In [31]:
# combined ranking housing and school

In [32]:
import os
import pandas as pd

In [33]:
# filenames
housing_rank_file = os.path.join("Results","house_rent_ranking.csv")
school_rank_file = os.path.join("Results","school_ranking.csv")

In [34]:
housing_rank = pd.read_csv(housing_rank_file)
school_rank = pd.read_csv(school_rank_file)

In [35]:
housing_rank

            City  own  rent
0        Raleigh    8     8
1         Austin    7     7
2  Washington DC    6     6
3        Atlanta    5     4
4        Chicago    4     5
5       New York    3     2
6         Boston    2     3
7    Los Angeles    1     1

In [36]:
school_rank

            City  schools  college
0    Los Angeles        8        7
1         Austin        7        3
2        Atlanta        6        6
3  Washington DC        5        2
4       New York        4        5
5        Raleigh        3        8
6        Chicago        2        1
7         Boston        1        4

In [37]:
# combine ranking into one file
combined_rank = housing_rank.merge(school_rank, on='City')

In [38]:
combined_rank = combined_rank.set_index("City")
combined_rank

               own  rent  schools  college
City
Raleigh          8     8        3        8
Austin           7     7        7        3
Washington DC    6     6        5        2
Atlanta          5     4        6        6
Chicago          4     5        2        1
New York         3     2        4        5
Boston           2     3        1        4
Los Angeles      1     1        8        7

In [39]:
combined_rank_file = os.path.join("Results","house_afford_school_ranking.csv")
combined_rank.to_csv(combined_rank_file)